[
  {
    "title": "Dead Reckoning",
    "review": "really good, goo story, good cast, will keep you hooked",
    "dow": "26th may 2025"
  },
  {
    "title": "The Curious Case of Benjamin Button",
    "review": "felt like forrest gump, really just a heartwarming tale about a man's life, not a MUST WATCH but yeah you'll enjoy it",
    "dow": "28th may 2025"
  },
  {
    "title": "Pawn Sacrifice",
    "review": "good, again it's mostly the life of bobby fischer and it doesn't go too crazy. They really just tried paying tribute and did a good job at it; it is interesting though",
    "dow": "31st may 2025"
  },
  {
    "title": "Creed",
    "review": "the grip song scene could be straight out of bladerunner if you just cut it right. The build up is good. Made me realise it's a damn shame I didn't grow up learning atleast a single form of combat, martial arts, or any competetive sport. Don't watch if you wanna stay a looser. Will make you wanna take up the name 'Creed'",
    "dow": "4th june, 2025"
  },
  {
    "title": "Zodiac",
    "review": "the start was pretty interesting with jake acting like a boy scout. The lake side killing left me speechless: to stab several times after tying them up, just because they complied and he didn't get the kick out of it is totally insane. It almost seems as if one of the characters shown in the movie could very well be the killer, like he is amongst us, just unnoticed. Also shows how the human error by two cops if prevented could have helped save a lot of lives. Almost seemed like everyone wanted their share of being famous and pretending to be the zodiac. I think jake had the most important role, and then mark. It's the perfect story, it's shocking how this isn't a work of fiction. Amazing.",
    "dow": "6th june, 2025"
  },
  {
    "title": "Blade Runner 2049",
    "review": "it's been intriguing so far. I can't decide if i would wanna live in that setting of a world, devoid mostly of real interactions and much solitude and people just straight up communicating what they need... This is quite interesting like the contrast at points... That line about half as much but twice as elegant ~ beautiful. One shocking thing was how even in future people have reached the stage where they can literally create humans, but they san diego municipal waste area has landfills reaching the height of sky scrapers, we really are never getting a solution for that I guess. At times I think this movies speaks a lot about men, just the silence of officer k tells you a lot...living that life of quiet desperation, but longing for change, some real connection, looking for reasons to tell yourself that you are special, but then finding it hard to believe once you find that reason... At one point joi is trying to sync with that girl and then the very next scene joi is a product mass produced, just the fucking contrast is too much. Personally I think ana de armas was the perfect casting, maybe scarlett johansson or eva green could have worked, but yeah she was perfect. Really grateful that I watched it a second time, I really don't get a movie in the first watch, maybe because most of those that I watched was during my jee time, so yeah that explains it. The moment where he presents deckard with a replicant copy of rachael... Oh, at the time of watching this I liked a girl dearly, and can't fathom the pain, even though you know it's fake you would still want to feel her skin and be speechless just as deckard was.... Can't be stoic in such a situation even if you try. You look lonely, i can fix that, you look like a good joe ~ damn that scene means entirely different from the meme once you know that context. I don't think I am qualified enough to say this but one instant that I think was an error was when joe hands deckard the horse and deckard uses just one hand, though he is speechless, wouldn't you wanna use both your hands for something of such profound significance? it just bothered me.. Great fucking job by Denis vilenueve",
    "dow": "7th june, 2025"
  }
]
